const charMap: Record<string, string> = {
  'ఓం': 'ॐ',
  'అ': 'अ',
  'ఆ': 'आ',
  'ఇ': 'इ',
  'ఈ': 'ई',
  'ఉ': 'उ',
  'ఊ': 'ऊ',
  'ఋ': 'ऋ',
  'ౠ': 'ॠ',
  'ఌ': 'ऌ',
  'ౡ': 'ॡ',
  'ఎ': 'ए',
  'ఏ': 'ए',
  'ఐ': 'ऐ',
  'ఒ': 'ओ',
  'ఓ': 'ओ',
  'ఔ': 'औ',
  'ా': 'ा',
  'ి': 'ि',
  'ీ': 'ी',
  'ు': 'ु',
  'ూ': 'ू',
  'ృ': 'ृ',
  'ౄ': 'ॄ',
  'ౢ': 'ॢ',
  'ౣ': 'ॣ',
  'ె': 'े',
  'ే': 'े',
  'ై': 'ै',
  'ొ': 'ो',
  'ో': 'ो',
  'ౌ': 'ौ',
  'ం': 'ं',
  'ః': 'ः',
  'ఁ': 'ँ',
  'ఽ': 'ऽ',
  '్': '्',
  'క': 'क',
  'ఖ': 'ख',
  'గ': 'ग',
  'ఘ': 'घ',
  'ఙ': 'ङ',
  'చ': 'च',
  'ఛ': 'छ',
  'జ': 'ज',
  'ఝ': 'झ',
  'ఞ': 'ञ',
  'ట': 'ट',
  'ఠ': 'ठ',
  'డ': 'ड',
  'ఢ': 'ढ',
  'ణ': 'ण',
  'త': 'त',
  'థ': 'थ',
  'ద': 'द',
  'ధ': 'ध',
  'న': 'न',
  'ప': 'प',
  'ఫ': 'फ',
  'బ': 'ब',
  'భ': 'भ',
  'మ': 'म',
  'య': 'य',
  'ర': 'र',
  'ల': 'ल',
  'వ': 'व',
  'శ': 'श',
  'ష': 'ष',
  'స': 'स',
  'హ': 'ह',
  'ళ': 'ळ',
  'క్ష': 'क्ष',
  'జ్ఞ': 'ज्ञ',
};

export function teluguToDevanagari(text: string) {
  let result = '';

  for (let index = 0; index < text.length; index += 1) {
    const nextTwo = text.slice(index, index + 2);

    if (charMap[nextTwo]) {
      result += charMap[nextTwo];
      index += 1;
      continue;
    }

    result += charMap[text[index]] ?? text[index];
  }

  return result;
}
